In [49]:
import pandas as pd

In [77]:
# basit bir dataframe olusturdum
dictionary={"isim":["tuba","ayse","edanur","derya","arda","mehmet"],
            "yas":[24,19,24,45,32,14],
            "maas":[300.0, 250.0, 240.0, 350.0, 180.0, 220.0]}
dictionary

{'isim': ['tuba', 'ayse', 'edanur', 'derya', 'arda', 'mehmet'],
 'yas': [24, 19, 24, 45, 32, 14],
 'maas': [300.0, 250.0, 240.0, 350.0, 180.0, 220.0]}

In [79]:
veri=pd.DataFrame(dictionary)

In [81]:
veri.head() #ilk 5 satırı bakılır

     isim  yas   maas
0    tuba   24  300.0
1    ayse   19  250.0
2  edanur   24  240.0
3   derya   45  350.0
4    arda   32  180.0

In [83]:
veri.tail() #son bes satır

     isim  yas   maas
1    ayse   19  250.0
2  edanur   24  240.0
3   derya   45  350.0
4    arda   32  180.0
5  mehmet   14  220.0

In [85]:
veri.columns # verinin sutunlari

Index(['isim', 'yas', 'maas'], dtype='object')

In [87]:
# dataframe ile ilgili temel bilgilere  info ile erişilir
veri.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   isim    6 non-null      object
 1   yas     6 non-null      int64
 2   maas    6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 276.0+ bytes

In [89]:
# veri seti icerisinde bulunan numeric feature'larin temel istatistiksel analizine bakılır
veri.describe()

             yas        maas
count   6.000000    6.000000
mean   26.333333  256.666667
std    10.930081   60.221812
min    14.000000  180.000000
25%    20.250000  225.000000
50%    24.000000  245.000000
75%    30.000000  287.500000
max    45.000000  350.000000

In [91]:
veri["yas"]

0    24
1    19
2    24
3    45
4    32
5    14
Name: yas, dtype: int64

In [93]:
veri["maas"]

0    300.0
1    250.0
2    240.0
3    350.0
4    180.0
5    220.0
Name: maas, dtype: float64

In [95]:
# dataframe icerisine yeni sutun ekleme
veri["sehir"] = ["istanbul", "yalova", "ankara", "bursa", "izmir", "antalya"]
veri

     isim  yas   maas     sehir
0    tuba   24  300.0  istanbul
1    ayse   19  250.0    yalova
2  edanur   24  240.0    ankara
3   derya   45  350.0     bursa
4    arda   32  180.0     izmir
5  mehmet   14  220.0   antalya

In [97]:
veri["maas_zamli"] = veri["maas"] + 15*veri["maas"]/100
veri #yüzde 15 zam oranı maasa eklenir

     isim  yas   maas     sehir  maas_zamli
0    tuba   24  300.0  istanbul       345.0
1    ayse   19  250.0    yalova       287.5
2  edanur   24  240.0    ankara       276.0
3   derya   45  350.0     bursa       402.5
4    arda   32  180.0     izmir       207.0
5  mehmet   14  220.0   antalya       253.0

In [99]:
# loc = location kisaltma
veri.loc[:, "yas"] # row=satirlar, column = sutunlar

0    24
1    19
2    24
3    45
4    32
5    14
Name: yas, dtype: int64

In [101]:
veri.loc[0:2, "yas"]

0    24
1    19
2    24
Name: yas, dtype: int64

In [103]:
veri.columns

Index(['isim', 'yas', 'maas', 'sehir', 'maas_zamli'], dtype='object')

In [107]:
veri.loc[0:3, ['yas', 'maas', 'sehir']]

   yas   maas     sehir
0   24  300.0  istanbul
1   19  250.0    yalova
2   24  240.0    ankara
3   45  350.0     bursa

In [109]:
veri

     isim  yas   maas     sehir  maas_zamli
0    tuba   24  300.0  istanbul       345.0
1    ayse   19  250.0    yalova       287.5
2  edanur   24  240.0    ankara       276.0
3   derya   45  350.0     bursa       402.5
4    arda   32  180.0     izmir       207.0
5  mehmet   14  220.0   antalya       253.0

In [115]:
#0 ve 1 satırın 1.sütundaki değerleri
veri.iloc[0:2, 1]

0    24
1    19
Name: yas, dtype: int64

In [113]:
#2. ve 4. satırın 1. ve 2. sütunundaki değerleri
veri.iloc[[2,4], [1,2]]

   yas   maas
2   24  240.0
4   32  180.0

In [121]:
veri["maas_zamli"]=veri["maas"]+50
veri

     isim  yas   maas     sehir  maas_zamli
0    tuba   24  300.0  istanbul       350.0
1    ayse   19  250.0    yalova       300.0
2  edanur   24  240.0    ankara       290.0
3   derya   45  350.0     bursa       400.0
4    arda   32  180.0     izmir       230.0
5  mehmet   14  220.0   antalya       270.0

In [125]:
#sutun isimlerini liste olarak alınır
cols = veri.columns.tolist()
cols

['isim', 'yas', 'maas', 'sehir', 'maas_zamli']

In [131]:
maas2_index = cols.index('maas_zamli')
maas2_index

4

In [133]:
cols.remove('maas_zamli')
cols

['isim', 'yas', 'maas', 'sehir']

In [135]:
cols.insert(1, 'maas_zamli')

In [140]:
cols

['isim', 'maas_zamli', 'yas', 'maas', 'sehir']

In [142]:
veri = veri[cols]

In [144]:
veri

     isim  maas_zamli  yas   maas     sehir
0    tuba       350.0   24  300.0  istanbul
1    ayse       300.0   19  250.0    yalova
2  edanur       290.0   24  240.0    ankara
3   derya       400.0   45  350.0     bursa
4    arda       230.0   32  180.0     izmir
5  mehmet       270.0   14  220.0   antalya

In [146]:
filtre1 = veri["yas"] > 22
filtre1

0     True
1    False
2     True
3     True
4     True
5    False
Name: yas, dtype: bool

In [148]:
filtrelenmis_veri = veri[filtre1]
filtrelenmis_veri

     isim  maas_zamli  yas   maas     sehir
0    tuba       350.0   24  300.0  istanbul
2  edanur       290.0   24  240.0    ankara
3   derya       400.0   45  350.0     bursa
4    arda       230.0   32  180.0     izmir

In [150]:
filtre2 = veri["sehir"] == "istanbul"
veri[filtre2]

   isim  maas_zamli  yas   maas     sehir
0  tuba       350.0   24  300.0  istanbul

In [152]:
veri[filtre1 & filtre2]

   isim  maas_zamli  yas   maas     sehir
0  tuba       350.0   24  300.0  istanbul

In [157]:
filtre3 = veri["isim"] == "edanur"
veri[filtre3]

     isim  maas_zamli  yas   maas   sehir
2  edanur       290.0   24  240.0  ankara

In [159]:
import numpy as np
np.bitwise_and(veri["sehir"] == "ankara", veri["yas"] > 22)

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [161]:
filtered_veri = veri.loc[(veri["sehir"] == "ankara") & (veri["yas"] > 22)]
print(filtered_veri)

     isim  maas_zamli  yas   maas   sehir
2  edanur       290.0   24  240.0  ankara

In [181]:
dictionary = {"isim": ["tuba", "edanur", "mehmet", "burak", "ayse", "derya"],
              "yas": [24, 26, 27, 33, 45 , 40],
              "sehir": ["istanbul", "ankara", "izmir", "ankara", "ankara","antalya"]}
veri=pd.DataFrame(dictionary)
veri

     isim  yas     sehir
0    tuba   24  istanbul
1  edanur   26    ankara
2  mehmet   27     izmir
3   burak   33    ankara
4    ayse   45    ankara
5   derya   40   antalya

In [183]:
#maas sutunu ekleme
veri["maas"]=[500,200,300,400,500,600]
veri

     isim  yas     sehir  maas
0    tuba   24  istanbul   500
1  edanur   26    ankara   200
2  mehmet   27     izmir   300
3   burak   33    ankara   400
4    ayse   45    ankara   500
5   derya   40   antalya   600

In [187]:
#yas/maas orani sutunu ekleme
veri["yas_maas"] = veri["yas"] / veri["maas"]
veri

     isim  yas     sehir  maas  yas_maas
0    tuba   24  istanbul   500  0.048000
1  edanur   26    ankara   200  0.130000
2  mehmet   27     izmir   300  0.090000
3   burak   33    ankara   400  0.082500
4    ayse   45    ankara   500  0.090000
5   derya   40   antalya   600  0.066667

In [189]:
 #yas/maas sutunu icin ortalamayi print ettirme
np.mean(veri["yas_maas"])

0.08452777777777777

In [191]:
veri["ulke"] = ["turkiye"]*len(veri)
veri

     isim  yas     sehir  maas  yas_maas     ulke
0    tuba   24  istanbul   500  0.048000  turkiye
1  edanur   26    ankara   200  0.130000  turkiye
2  mehmet   27     izmir   300  0.090000  turkiye
3   burak   33    ankara   400  0.082500  turkiye
4    ayse   45    ankara   500  0.090000  turkiye
5   derya   40   antalya   600  0.066667  turkiye

In [211]:
#ankarada yasayanlarin ortalama yasini bul
ankarada_yasayanlar = veri[veri["sehir"] == "ankara"]
ankarada_yasayanlar

     isim  yas   sehir  maas  yas_maas     ulke
1  edanur   26  ankara   200    0.1300  turkiye
3   burak   33  ankara   400    0.0825  turkiye
4    ayse   45  ankara   500    0.0900  turkiye

In [213]:
#ankarada yasayanlarin ortalama yasini bul
ankarada_yasayanlar_yas = ankarada_yasayanlar["yas"]
ankarada_yasayanlar_yas

1    26
3    33
4    45
Name: yas, dtype: int64

In [215]:
#ankarada yasayanlarin ortalama yasini bul
ort = np.mean(ankarada_yasayanlar_yas)
ort

34.666666666666664

In [217]:
#ankarada yasayanlarin icinden en yuksek maas alani bul
ankarada_yasayanlar = veri[veri["sehir"] == "ankara"]
ankarada_yasayanlar

     isim  yas   sehir  maas  yas_maas     ulke
1  edanur   26  ankara   200    0.1300  turkiye
3   burak   33  ankara   400    0.0825  turkiye
4    ayse   45  ankara   500    0.0900  turkiye

In [219]:
#ankarada yasayanlarin icinden en yuksek maas alani bul
ankarada_yasayanlar_maas = ankarada_yasayanlar["maas"]
ankarada_yasayanlar_maas

1    200
3    400
4    500
Name: maas, dtype: int64

In [221]:
#ankarada yasayanlarin icinden en yuksek maas alani bul
np.max(ankarada_yasayanlar_maas)

500

In [223]:
ankarada_yasayanlar

     isim  yas   sehir  maas  yas_maas     ulke
1  edanur   26  ankara   200    0.1300  turkiye
3   burak   33  ankara   400    0.0825  turkiye
4    ayse   45  ankara   500    0.0900  turkiye

In [230]:
#ankarada maximum maas alanin ismi
maks_maas = 0
maks_isim = ""
for i in range(len(ankarada_yasayanlar)):
    if ankarada_yasayanlar["maas"][i] > maks_maas:
        maks_maas = ankarada_yasayanlar["maas"][i]
        maks_isim = ankarada_yasayanlar["isim"][i]

print(maks_isim)

ayse

In [232]:
ankarada_yasayanlar.loc[ankarada_yasayanlar["maas"].idxmax(), "isim"]

'ayse'

In [234]:
veri

     isim  yas     sehir  maas  yas_maas     ulke
0    tuba   24  istanbul   500  0.048000  turkiye
1  edanur   26    ankara   200  0.130000  turkiye
2  mehmet   27     izmir   300  0.090000  turkiye
3   burak   33    ankara   400  0.082500  turkiye
4    ayse   45    ankara   500  0.090000  turkiye
5   derya   40   antalya   600  0.066667  turkiye

In [236]:
veri_yas = veri.yas
print(veri_yas)
# yas stununun ortalamasini bul
veri_yas_mean = np.mean(veri_yas)
print(f"veri_yas_mean: {veri_yas_mean}")
# for dongusu ile insanlarin yasini ortalamaya ile kiyasla
# eger yaslari kucuk ise bir listenini icerisine "kucuk" yazdir degilse(buyukse) "buyuk" yazdir
liste_yas_grubu = []
for i in range(len(veri_yas)):
  dummy_veri_yas = veri_yas[i]
  if veri_yas_mean > dummy_veri_yas:
    liste_yas_grubu.append("kucuk")
  else:
    liste_yas_grubu.append("buyuk")
print(liste_yas_grubu)
veri["yas_grubu"] = liste_yas_grubu
print(veri)

0    24
1    26
2    27
3    33
4    45
5    40
Name: yas, dtype: int64
veri_yas_mean: 32.5
['kucuk', 'kucuk', 'kucuk', 'buyuk', 'buyuk', 'buyuk']
     isim  yas     sehir  maas  yas_maas     ulke yas_grubu
0    tuba   24  istanbul   500  0.048000  turkiye     kucuk
1  edanur   26    ankara   200  0.130000  turkiye     kucuk
2  mehmet   27     izmir   300  0.090000  turkiye     kucuk
3   burak   33    ankara   400  0.082500  turkiye     buyuk
4    ayse   45    ankara   500  0.090000  turkiye     buyuk
5   derya   40   antalya   600  0.066667  turkiye     buyuk

In [240]:
veri["yas_grubu2"]=["kucuk" if veri_yas_mean > veri_yas[i] else "buyuk" for i in range(len(veri_yas))]
veri

     isim  yas     sehir  maas  yas_maas     ulke yas_grubu yas_grubu2
0    tuba   24  istanbul   500  0.048000  turkiye     kucuk      kucuk
1  edanur   26    ankara   200  0.130000  turkiye     kucuk      kucuk
2  mehmet   27     izmir   300  0.090000  turkiye     kucuk      kucuk
3   burak   33    ankara   400  0.082500  turkiye     buyuk      buyuk
4    ayse   45    ankara   500  0.090000  turkiye     buyuk      buyuk
5   derya   40   antalya   600  0.066667  turkiye     buyuk      buyuk

In [242]:
veri["YAS_GRUBU2"] = [i.upper() for i in veri.yas_grubu2]
veri

,isim,yas,sehir,maas,yas_maas,ulke,yas_grubu,yas_grubu2,YAS_GRUBU2
0,tuba,24,istanbul,500,0.048000,turkiye,kucuk,kucuk,KUCUK
1,edanur,26,ankara,200,0.130000,turkiye,kucuk,kucuk,KUCUK
2,mehmet,27,izmir,300,0.090000,turkiye,kucuk,kucuk,KUCUK
3,burak,33,ankara,400,0.082500,turkiye,buyuk,buyuk,BUYUK
4,ayse,45,ankara,500,0.090000,turkiye,buyuk,buyuk,BUYUK
5,derya,40,antalya,600,0.066667,turkiye,buyuk,buyuk,BUYUK

In [244]:
veri.index.tolist()

[0, 1, 2, 3, 4, 5]

In [246]:
# tum satirlara bakalim eger ankarada yasayan varsa, yasini x 2 , else yas x 5 new_yas sutun olusturalim
veri["new_yas"]=[veri.yas[i]*2 if veri.sehir[i]=="ankara" else veri.yas[i]*5 for i in range(len(veri))]
veri

,isim,yas,sehir,maas,yas_maas,ulke,yas_grubu,yas_grubu2,YAS_GRUBU2,new_yas
0,tuba,24,istanbul,500,0.048000,turkiye,kucuk,kucuk,KUCUK,120
1,edanur,26,ankara,200,0.130000,turkiye,kucuk,kucuk,KUCUK,52
2,mehmet,27,izmir,300,0.090000,turkiye,kucuk,kucuk,KUCUK,135
3,burak,33,ankara,400,0.082500,turkiye,buyuk,buyuk,BUYUK,66
4,ayse,45,ankara,500,0.090000,turkiye,buyuk,buyuk,BUYUK,90
5,derya,40,antalya,600,0.066667,turkiye,buyuk,buyuk,BUYUK,200

In [248]:
def yas10YilSonrasi(age):
  output = age + 10
  return output

In [250]:
veri["yas_10_yil_sonrasi"] = veri.yas.apply(yas10YilSonrasi)
veri

,isim,yas,sehir,maas,yas_maas,ulke,yas_grubu,yas_grubu2,YAS_GRUBU2,new_yas,yas_10_yil_sonrasi
0,tuba,24,istanbul,500,0.048000,turkiye,kucuk,kucuk,KUCUK,120,34
1,edanur,26,ankara,200,0.130000,turkiye,kucuk,kucuk,KUCUK,52,36
2,mehmet,27,izmir,300,0.090000,turkiye,kucuk,kucuk,KUCUK,135,37
3,burak,33,ankara,400,0.082500,turkiye,buyuk,buyuk,BUYUK,66,43
4,ayse,45,ankara,500,0.090000,turkiye,buyuk,buyuk,BUYUK,90,55
5,derya,40,antalya,600,0.066667,turkiye,buyuk,buyuk,BUYUK,200,50

In [252]:
# dataframe de bulunan insanlarin isimlerinin uzunlugu == 5 ise yeni yasi 2 ile varpalim
# eger isim uzunlugu == 4 ise 3 ile carpalim else 4 ile carpalim
def nameLength(df):
  if len(df.isim)==5:
    return df.yas*2
  elif len(df.isim)==4:
    return df.yas*3
  else:
    return df.yas*4
veri["new_age3"]=veri.apply(nameLength, axis=1)
veri

,isim,yas,sehir,maas,yas_maas,ulke,yas_grubu,yas_grubu2,YAS_GRUBU2,new_yas,yas_10_yil_sonrasi,new_age3
0,tuba,24,istanbul,500,0.048000,turkiye,kucuk,kucuk,KUCUK,120,34,72
1,edanur,26,ankara,200,0.130000,turkiye,kucuk,kucuk,KUCUK,52,36,104
2,mehmet,27,izmir,300,0.090000,turkiye,kucuk,kucuk,KUCUK,135,37,108
3,burak,33,ankara,400,0.082500,turkiye,buyuk,buyuk,BUYUK,66,43,66
4,ayse,45,ankara,500,0.090000,turkiye,buyuk,buyuk,BUYUK,90,55,135
5,derya,40,antalya,600,0.066667,turkiye,buyuk,buyuk,BUYUK,200,50,80

In [254]:
sozluk1 = {"isim": ["ali", "veli"],
           "yas": [15, 16]}
veri1 = pd.DataFrame(sozluk1)
veri1

   isim  yas
0   ali   15
1  veli   16

In [256]:
sozluk2 = {"isim": ["murat", "ayse"],
           "yas": [32, 33]}
veri2 = pd.DataFrame(sozluk2)
veri2

    isim  yas
0  murat   32
1   ayse   33

In [258]:
veri_dikey = pd.concat([veri1, veri2], axis = 0)
veri_dikey

    isim  yas
0    ali   15
1   veli   16
0  murat   32
1   ayse   33

In [260]:
veri_yatay = pd.concat([veri1, veri2], axis = 1)
veri_yatay

   isim  yas   isim  yas
0   ali   15  murat   32
1  veli   16   ayse   33

In [270]:
sozluk1 = {"isim": ["ali", "veli"],
           "yas": [15, 16]}
veri1 = pd.DataFrame(sozluk1)
veri1

sozluk3 = {"sehir": ["ankara", "istanbul"],
           "yas": [22, 23]}
veri3 = pd.DataFrame(sozluk3)
veri3

      sehir  yas
0    ankara   22
1  istanbul   23

In [272]:
veri_dikey = pd.concat([veri1, veri3], axis = 0, ignore_index=True)
# veri_dikey.reset_index(drop=True, inplace=True)
veri_dikey

   isim  yas     sehir
0   ali   15       NaN
1  veli   16       NaN
2   NaN   22    ankara
3   NaN   23  istanbul